/* Задания на урок:

1) Удалить все рекламные блоки со страницы (правая часть сайта)

2) Изменить жанр фильма, поменять "комедия" на "драма"

3) Изменить задний фон постера с фильмом на изображение "bg.jpg". Оно лежит в папке img.
Реализовать только при помощи JS

4) Список фильмов на странице сформировать на основании данных из этого JS файла.
Отсортировать их по алфавиту 

5) Добавить нумерацию выведенных фильмов */

'use strict';

const movieDB = {
    movies: [
        "Логан",
        "Лига справедливости",
        "Ла-ла лэнд",
        "Одержимость",
        "Скотт Пилигрим против..."
    ]
};



//Task№1 ------------------------------------------------------------------------
let div = document.getElementsByClassName("promo__adv");
div[0].remove();
//--------------------------------------------------------------------------------


// Task№2--------------------------------------------------------------------------
let div2 = document.getElementsByClassName("promo__genre");
div2[0].textContent = "Драмма";
//--------------------------------------------------------------------------------


// Task№3-----------------------------------------------------------------------------
let div3 = document.getElementsByClassName("promo__bg");
div3[0].style.backgroundImage = "url(img/bg.jpg)"
//-------------------------------------------------------------------------------------


//Task№4---------------------------------------------------------------------------------
let arr = movieDB.movies;
arr = arr.sort();
let films = document.getElementsByClassName("promo__interactive-item");
let del = document.getElementsByClassName("delete");


for (let i = 0; i < 5; i++) {
    del[0].remove();
};

for (let i = 0; i < 5; i++) {
    films[i].innerHTML = `№${(i + 1)} ${arr[i]}`
}

//---------------------------------------------------------------------------------